<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8" /><title>12.2. Match</title><link rel="stylesheet" type="text/css" href="docbook-xsl.css" /><meta name="generator" content="DocBook XSL Stylesheets V1.76.1" /><link rel="home" href="index.html" title="The Neo4j Manual v1.9.6" /><link rel="up" href="query-read.html" title="Chapter 12. Reading Clauses" /><link rel="prev" href="query-start.html" title="12.1. Start" /><link rel="next" href="query-where.html" title="12.3. Where" /><link rel="preface" href="preface.html" title="Preface" /><link rel="part" href="introduction.html" title="Part I. Introduction" /><link rel="chapter" href="introduction-highlights.html" title="Chapter 1. Neo4j Highlights" /><link rel="chapter" href="graphdb-concepts.html" title="Chapter 2. Graph Database Concepts" /><link rel="chapter" href="graphdb-neo4j.html" title="Chapter 3. The Neo4j Graph Database" /><link rel="part" href="tutorials.html" title="Part II. Tutorials" /><link rel="chapter" href="tutorials-java-embedded.html" title="Chapter 4. Using Neo4j embedded in Java applications" /><link rel="chapter" href="tutorials-rest.html" title="Chapter 5. Neo4j Remote Client Libraries" /><link rel="chapter" href="tutorial-traversal.html" title="Chapter 6. The Traversal Framework" /><link rel="chapter" href="data-modeling-examples.html" title="Chapter 7. Data Modeling Examples" /><link rel="chapter" href="languages.html" title="Chapter 8. Languages" /><link rel="chapter" href="server-extending.html" title="Chapter 9. Extending the Neo4j Server" /><link rel="part" href="cypher-query-lang.html" title="Part III. Cypher Query Language" /><link rel="chapter" href="cypher-intro.html" title="Chapter 10. Introduction" /><link rel="chapter" href="query-syntax.html" title="Chapter 11. Syntax" /><link rel="chapter" href="query-read.html" title="Chapter 12. Reading Clauses" /><link rel="chapter" href="query-write.html" title="Chapter 13. Writing Clauses" /><link rel="chapter" href="query-function.html" title="Chapter 14. Functions" /><link rel="chapter" href="examples-from-sql-to-cypher.html" title="Chapter 15. From SQL to Cypher" /><link rel="part" href="reference-documentation.html" title="Part IV. Reference" /><link rel="chapter" href="capabilities.html" title="Chapter 16. Capabilities" /><link rel="chapter" href="transactions.html" title="Chapter 17. Transaction Management" /><link rel="chapter" href="import.html" title="Chapter 18. Data Import" /><link rel="chapter" href="indexing.html" title="Chapter 19. Indexing" /><link rel="chapter" href="graph-algo.html" title="Chapter 20. Graph Algorithms" /><link rel="chapter" href="server.html" title="Chapter 21. Neo4j Server" /><link rel="chapter" href="rest-api.html" title="Chapter 22. REST API" /><link rel="chapter" href="deprecations.html" title="Chapter 23. Deprecations" /><link rel="part" href="operations.html" title="Part V. Operations" /><link rel="chapter" href="deployment.html" title="Chapter 24. Installation &amp; Deployment" /><link rel="chapter" href="embedded-configuration.html" title="Chapter 25. Configuration &amp; Performance" /><link rel="chapter" href="ha.html" title="Chapter 26. High Availability" /><link rel="chapter" href="operations-backup.html" title="Chapter 27. Backup" /><link rel="chapter" href="operations-security.html" title="Chapter 28. Security" /><link rel="chapter" href="operations-monitoring.html" title="Chapter 29. Monitoring" /><link rel="part" href="tools.html" title="Part VI. Tools" /><link rel="chapter" href="tools-webadmin.html" title="Chapter 30. Web Interface" /><link rel="chapter" href="shell.html" title="Chapter 31. Neo4j Shell" /><link rel="part" href="community.html" title="Part VII. Community" /><link rel="chapter" href="community-support.html" title="Chapter 32. Community Support" /><link rel="chapter" href="community-contributing.html" title="Chapter 33. Contributing to Neo4j" /><link rel="appendix" href="manpages.html" title="Appendix A. Manpages" /><link rel="refentry" href="re01.html" title="neo4j" /><link rel="refentry" href="re02.html" title="neo4j-shell" /><link rel="refentry" href="re03.html" title="neo4j-backup" /><link rel="refentry" href="re04.html" title="neo4j-arbiter" /><link rel="subsection" href="query-match.html#_introduction" title="12.2.1. Introduction" /><link rel="subsection" href="query-match.html#match-related-nodes" title="12.2.2. Related nodes" /><link rel="subsection" href="query-match.html#match-outgoing-relationships" title="12.2.3. Outgoing relationships" /><link rel="subsection" href="query-match.html#match-directed-relationships-and-identifier" title="12.2.4. Directed relationships and identifier" /><link rel="subsection" href="query-match.html#match-match-by-relationship-type" title="12.2.5. Match by relationship type" /><link rel="subsection" href="query-match.html#match-match-by-multiple-relationship-types" title="12.2.6. Match by multiple relationship types" /><link rel="subsection" href="query-match.html#match-match-by-relationship-type-and-use-an-identifier" title="12.2.7. Match by relationship type and use an identifier" /><link rel="subsection" href="query-match.html#match-relationship-types-with-uncommon-characters" title="12.2.8. Relationship types with uncommon characters" /><link rel="subsection" href="query-match.html#match-multiple-relationships" title="12.2.9. Multiple relationships" /><link rel="subsection" href="query-match.html#match-variable-length-relationships" title="12.2.10. Variable length relationships" /><link rel="subsection" href="query-match.html#match-relationship-identifier-in-variable-length-relationships" title="12.2.11. Relationship identifier in variable length relationships" /><link rel="subsection" href="query-match.html#match-zero-length-paths" title="12.2.12. Zero length paths" /><link rel="subsection" href="query-match.html#match-optional-relationship" title="12.2.13. Optional relationship" /><link rel="subsection" href="query-match.html#match-optional-typed-and-named-relationship" title="12.2.14. Optional typed and named relationship" /><link rel="subsection" href="query-match.html#match-properties-on-optional-elements" title="12.2.15. Properties on optional elements" /><link rel="subsection" href="query-match.html#match-complex-matching" title="12.2.16. Complex matching" /><link rel="subsection" href="query-match.html#match-shortest-path" title="12.2.17. Shortest path" /><link rel="subsection" href="query-match.html#match-all-shortest-paths" title="12.2.18. All shortest paths" /><link rel="subsection" href="query-match.html#match-named-path" title="12.2.19. Named path" /><link rel="subsection" href="query-match.html#match-matching-on-a-bound-relationship" title="12.2.20. Matching on a bound relationship" /><link rel="subsection" href="query-match.html#match-match-with-or" title="12.2.21. Match with OR" /><link rel="copyright" href="ln-idp1112768.html" title="License: Creative Commons 3.0" />


<!-- favicon -->

<link rel="shortcut icon" href="http://neo4j.org/favicon.ico" type="image/vnd.microsoft.icon" />
<link rel="icon" href="http://neo4j.org/favicon.ico" type="image/x-icon" />

<!-- style -->

<link href="css/shCore.css" rel="stylesheet" type="text/css" />
<link href="css/shCoreEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/shThemeEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/neo.css" rel="stylesheet" type="text/css" />

<!-- Syntax Highlighter -->

<script type="text/javascript" src="js/shCore.js"></script>
<script type="text/javascript" src="js/shBrushJava.js"></script>
<script type="text/javascript" src="js/shBrushJScript.js"></script>
<script type="text/javascript" src="js/shBrushBash.js"></script>
<script type="text/javascript" src="js/shBrushPlain.js"></script>
<script type="text/javascript" src="js/shBrushXml.js"></script>
<script type="text/javascript" src="js/shBrushGroovy.js"></script>
<script type="text/javascript" src="js/shBrushCypher.js"></script>
<script type="text/javascript" src="js/shBrushScala.js"></script>
<script type="text/javascript" src="js/shBrushSql.js"></script>
<script type="text/javascript" src="js/shBrushPython.js"></script>
<script type="text/javascript" src="js/shBrushProperties.js"></script>

<!-- activate when needed
<script type="text/javascript" src="js/shBrushRuby.js"></script>
<script type="text/javascript" src="js/shBrushCSharp.js"></script>
-->
 
<script type="text/javascript">
  SyntaxHighlighter.defaults['tab-size'] = 4;
  SyntaxHighlighter.defaults['gutter'] = false;
  SyntaxHighlighter.defaults['toolbar'] = false;
  SyntaxHighlighter.all()
</script>

<!-- JQuery -->

<script type="text/javascript" src="js/jquery-1.6.4.min.js"></script>

<!-- Replace SVG for browsers that lack support. -->
<script type="text/javascript" src="js/svgreplacer.js"></script>

<!-- Image Scaler -->

<script type="text/javascript" src="js/imagescaler.js"></script>

<!-- Table Styler -->

<script type="text/javascript" src="js/tablestyler.js"></script>

<!-- Version -->

<script type="text/javascript" src="js/version.js"></script>

<!-- Offline Sidebar -->

<script type="text/javascript" src="js/sidebar.js"></script>


<div xmlns="" class="breadcrumbs"><span class="breadcrumb-link"><a href="index.html">The Neo4j Manual</a></span> &gt; <span class="breadcrumb-link"><a href="cypher-query-lang.html">Cypher Query Language</a></span> &gt; <span class="breadcrumb-link"><a href="query-read.html">Reading Clauses</a></span> &gt; <span class="breadcrumb-node">Match</span></div></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tr><td width="20%" align="left"><a accesskey="p" href="query-start.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="query-where.html">Next</a></td></tr></table><hr /></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="query-match"></a>12.2. Match</h2></div></div></div><div class="toc"><dl><dt><span class="section"><a href="query-match.html#_introduction">12.2.1. Introduction</a></span></dt><dt><span class="section"><a href="query-match.html#match-related-nodes">12.2.2. Related nodes</a></span></dt><dt><span class="section"><a href="query-match.html#match-outgoing-relationships">12.2.3. Outgoing relationships</a></span></dt><dt><span class="section"><a href="query-match.html#match-directed-relationships-and-identifier">12.2.4. Directed relationships and identifier</a></span></dt><dt><span class="section"><a href="query-match.html#match-match-by-relationship-type">12.2.5. Match by relationship type</a></span></dt><dt><span class="section"><a href="query-match.html#match-match-by-multiple-relationship-types">12.2.6. Match by multiple relationship types</a></span></dt><dt><span class="section"><a href="query-match.html#match-match-by-relationship-type-and-use-an-identifier">12.2.7. Match by relationship type and use an identifier</a></span></dt><dt><span class="section"><a href="query-match.html#match-relationship-types-with-uncommon-characters">12.2.8. Relationship types with uncommon characters</a></span></dt><dt><span class="section"><a href="query-match.html#match-multiple-relationships">12.2.9. Multiple relationships</a></span></dt><dt><span class="section"><a href="query-match.html#match-variable-length-relationships">12.2.10. Variable length relationships</a></span></dt><dt><span class="section"><a href="query-match.html#match-relationship-identifier-in-variable-length-relationships">12.2.11. Relationship identifier in variable length relationships</a></span></dt><dt><span class="section"><a href="query-match.html#match-zero-length-paths">12.2.12. Zero length paths</a></span></dt><dt><span class="section"><a href="query-match.html#match-optional-relationship">12.2.13. Optional relationship</a></span></dt><dt><span class="section"><a href="query-match.html#match-optional-typed-and-named-relationship">12.2.14. Optional typed and named relationship</a></span></dt><dt><span class="section"><a href="query-match.html#match-properties-on-optional-elements">12.2.15. Properties on optional elements</a></span></dt><dt><span class="section"><a href="query-match.html#match-complex-matching">12.2.16. Complex matching</a></span></dt><dt><span class="section"><a href="query-match.html#match-shortest-path">12.2.17. Shortest path</a></span></dt><dt><span class="section"><a href="query-match.html#match-all-shortest-paths">12.2.18. All shortest paths</a></span></dt><dt><span class="section"><a href="query-match.html#match-named-path">12.2.19. Named path</a></span></dt><dt><span class="section"><a href="query-match.html#match-matching-on-a-bound-relationship">12.2.20. Matching on a bound relationship</a></span></dt><dt><span class="section"><a href="query-match.html#match-match-with-or">12.2.21. Match with OR</a></span></dt></dl></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="_introduction"></a>12.2.1. Introduction</h3></div></div></div><div class="tip" style="margin-left: 0; margin-right: 10%;"><table border="0" summary="Tip"><tr><td rowspan="2" align="center" valign="top" width="25"><img alt="[Tip]" src="images/icons/admon/tip.png" /></td><th align="left">Tip</th></tr><tr><td align="left" valign="top"><p>In the <code class="literal">MATCH</code> clause, patterns are used a lot.
Read <a class="xref" href="introduction-pattern.html" title="11.5. Patterns">Section 11.5, “Patterns”</a> for an introduction.</p></td></tr></table></div><p>The following graph is used for the examples below:</p><div class="figure"><a id="idp8089600"></a><p class="title"><strong>Figure 12.2. Graph</strong></p><div class="figure-contents"><a class="ulink" href="images/cypher-match-graph.svg" target="_top">
<span class="inlinemediaobject"><img src="images/cypher-match-graph.svg" alt="cypher-match-graph.svg" /></span>
</a></div></div><br class="figure-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-related-nodes"></a>12.2.2. Related nodes</h3></div></div></div><p>The symbol <code class="literal">--</code> means <span class="emphasis"><em>related to,</em></span> without regard to type or direction.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START n=node(3)
MATCH (n)--(x)
RETURN x</pre><p>
</p><p>All nodes related to A (Anders) are returned by the query.</p><div class="queryresult table"><a id="idp8098512"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">x</th></tr></thead><tfoot><tr><th align="left" valign="top">3 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[4]{name:"Bossman"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[1]{name:"David"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[5]{name:"Cesar"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-outgoing-relationships"></a>12.2.3. Outgoing relationships</h3></div></div></div><p>When the direction of a relationship is interesting, it is shown by using <code class="literal">--&gt;</code> or <code class="literal">&lt;--</code>, like this:</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START n=node(3)
MATCH (n)--&gt;(x)
RETURN x</pre><p>
</p><p>All nodes that A has outgoing relationships to are returned.</p><div class="queryresult table"><a id="idp8116528"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">x</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[4]{name:"Bossman"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[5]{name:"Cesar"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-directed-relationships-and-identifier"></a>12.2.4. Directed relationships and identifier</h3></div></div></div><p>If an identifier is needed, either for filtering on properties of the relationship, or to return the relationship, this is how you introduce the identifier.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START n=node(3)
MATCH (n)-[r]-&gt;()
RETURN r</pre><p>
</p><p>The query returns all outgoing relationships from node A.</p><div class="queryresult table"><a id="idp8131728"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">r</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">:KNOWS[0] {}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">:BLOCKS[1] {}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-match-by-relationship-type"></a>12.2.5. Match by relationship type</h3></div></div></div><p>When you know the relationship type you want to match on, you can specify it by using a colon together with the relationship type.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START n=node(3)
MATCH (n)-[:BLOCKS]-&gt;(x)
RETURN x</pre><p>
</p><p>All nodes that are BLOCKed by A are returned by this query.</p><div class="queryresult table"><a id="idp8146848"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">x</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[5]{name:"Cesar"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-match-by-multiple-relationship-types"></a>12.2.6. Match by multiple relationship types</h3></div></div></div><p>To match on one of multiple types, you can specify this by chaining them together with the pipe symbol <code class="literal">|</code>.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START n=node(3)
MATCH (n)-[:BLOCKS|KNOWS]-&gt;(x)
RETURN x</pre><p>
</p><p>All nodes with a <code class="literal">BLOCK</code> or <code class="literal">KNOWS</code> relationship to A are returned.</p><div class="queryresult table"><a id="idp8162672"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">x</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[5]{name:"Cesar"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[4]{name:"Bossman"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-match-by-relationship-type-and-use-an-identifier"></a>12.2.7. Match by relationship type and use an identifier</h3></div></div></div><p>If you both want to introduce an identifier to hold the relationship, and specify the relationship type you want, just add them both, like this.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START n=node(3)
MATCH (n)-[r:BLOCKS]-&gt;()
RETURN r</pre><p>
</p><p>All <code class="literal">BLOCKS</code> relationships going out from A are returned.</p><div class="queryresult table"><a id="idp8178544"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">r</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">:BLOCKS[1] {}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-relationship-types-with-uncommon-characters"></a>12.2.8. Relationship types with uncommon characters</h3></div></div></div><p>Sometime your database will have types with non-letter characters, or with spaces in them. Use <code class="literal">`</code> (backtick) to quote these.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START n=node(3)
MATCH (n)-[r:`TYPE THAT HAS SPACE IN IT`]-&gt;()
RETURN r</pre><p>
</p><p>This query returns a relationship of a type with spaces in it.</p><div class="queryresult table"><a id="idp8192992"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">r</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">:TYPE THAT HAS SPACE IN IT[6] {}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-multiple-relationships"></a>12.2.9. Multiple relationships</h3></div></div></div><p>Relationships can be expressed by using multiple statements in the form of <code class="literal">()--()</code>, or they can be strung together, like this:</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START a=node(3)
MATCH (a)-[:KNOWS]-&gt;(b)-[:KNOWS]-&gt;(c)
RETURN a,b,c</pre><p>
</p><p>The three nodes in the path are returned by the query.</p><div class="queryresult table"><a id="idp8207440"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /><col class="col3" /></colgroup><thead><tr><th align="left" valign="top">a</th><th align="left" valign="top">b</th><th align="left" valign="top">c</th></tr></thead><tfoot><tr><th colspan="3" align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[4]{name:"Bossman"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Emil"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-variable-length-relationships"></a>12.2.10. Variable length relationships</h3></div></div></div><p>Nodes that are a variable number of relationship→node hops away can be found using the following syntax: <code class="literal">-[:TYPE*minHops..maxHops]-&gt;</code>. minHops and maxHops are optional and default to 1 and infinity respectively. When no bounds are given the dots may be omitted.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START a=node(3), x=node(2, 4)
MATCH a-[:KNOWS*1..3]-&gt;x
RETURN a,x</pre><p>
</p><p>This query returns the start and end point, if there is a path between 1 and 3 relationships away.</p><div class="queryresult table"><a id="idp8227184"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /></colgroup><thead><tr><th align="left" valign="top">a</th><th align="left" valign="top">x</th></tr></thead><tfoot><tr><th colspan="2" align="left" valign="top">2 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Emil"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[4]{name:"Bossman"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-relationship-identifier-in-variable-length-relationships"></a>12.2.11. Relationship identifier in variable length relationships</h3></div></div></div><p>When the connection between two nodes is of variable length, a relationship identifier becomes an collection of relationships.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START a=node(3), x=node(2, 4)
MATCH a-[r:KNOWS*1..3]-&gt;x
RETURN r</pre><p>
</p><p>The query returns the relationships, if there is a path between 1 and 3 relationships away.</p><div class="queryresult table"><a id="idp8246400"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">r</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">[:KNOWS[0] {},:KNOWS[3] {}]</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">[:KNOWS[0] {}]</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-zero-length-paths"></a>12.2.12. Zero length paths</h3></div></div></div><p>Using variable length paths that have the lower bound zero means that two identifiers can point to the same node. If the distance between two nodes is zero, they are by definition the same node. Note that when matching zero length paths the result may contain a match even when matching on a relationship type not in use.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START a=node(3)
MATCH p1=a-[:KNOWS*0..1]-&gt;b, p2=b-[:BLOCKS*0..1]-&gt;c
RETURN a,b,c, length(p1), length(p2)</pre><p>
</p><p>This query will return four paths, some of which have length zero.</p><div class="queryresult table"><a id="idp8261952"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /><col class="col3" /><col class="col4" /><col class="col5" /></colgroup><thead><tr><th align="left" valign="top">a</th><th align="left" valign="top">b</th><th align="left" valign="top">c</th><th align="left" valign="top">length(p1)</th><th align="left" valign="top">length(p2)</th></tr></thead><tfoot><tr><th colspan="5" align="left" valign="top">4 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">0</code></p></td><td align="left" valign="top"><p><code class="literal">0</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[5]{name:"Cesar"}</code></p></td><td align="left" valign="top"><p><code class="literal">0</code></p></td><td align="left" valign="top"><p><code class="literal">1</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[4]{name:"Bossman"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[4]{name:"Bossman"}</code></p></td><td align="left" valign="top"><p><code class="literal">1</code></p></td><td align="left" valign="top"><p><code class="literal">0</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[4]{name:"Bossman"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[1]{name:"David"}</code></p></td><td align="left" valign="top"><p><code class="literal">1</code></p></td><td align="left" valign="top"><p><code class="literal">1</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-optional-relationship"></a>12.2.13. Optional relationship</h3></div></div></div><p>If a relationship is optional, it can be marked with a question mark. This is similar to how a SQL outer join works. If the relationship is there, it is returned. If it’s not, <code class="literal">null</code> is returned in it’s place. Remember that anything hanging off an optional relationship, is in turn optional, unless it is connected with a bound node through some other path.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START a=node(2)
MATCH a-[?]-&gt;x
RETURN a,x</pre><p>
</p><p>A node, and <code class="literal">null</code> are returned, since the node has no outgoing relationships.</p><div class="queryresult table"><a id="idp8308016"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /></colgroup><thead><tr><th align="left" valign="top">a</th><th align="left" valign="top">x</th></tr></thead><tfoot><tr><th colspan="2" align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Emil"}</code></p></td><td align="left" valign="top"><p><code class="literal">&lt;null&gt;</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-optional-typed-and-named-relationship"></a>12.2.14. Optional typed and named relationship</h3></div></div></div><p>Just as with a normal relationship, you can decide which identifier it goes into, and what relationship type you need.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START a=node(3)
MATCH a-[r?:LOVES]-&gt;()
RETURN a,r</pre><p>
</p><p>This returns a node, and <code class="literal">null</code>, since the node has no outgoing <code class="literal">LOVES</code> relationships.</p><div class="queryresult table"><a id="idp8325680"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /></colgroup><thead><tr><th align="left" valign="top">a</th><th align="left" valign="top">r</th></tr></thead><tfoot><tr><th colspan="2" align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">&lt;null&gt;</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-properties-on-optional-elements"></a>12.2.15. Properties on optional elements</h3></div></div></div><p>Returning a property from an optional element that is <code class="literal">null</code> will also return <code class="literal">null</code>.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START a=node(2)
MATCH a-[?]-&gt;x
RETURN x, x.name</pre><p>
</p><p>This returns the element x (<code class="literal">null</code> in this query), and <code class="literal">null</code> as it’s name.</p><div class="queryresult table"><a id="idp8344512"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /></colgroup><thead><tr><th align="left" valign="top">x</th><th align="left" valign="top">x.name</th></tr></thead><tfoot><tr><th colspan="2" align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">&lt;null&gt;</code></p></td><td align="left" valign="top"><p><code class="literal">&lt;null&gt;</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-complex-matching"></a>12.2.16. Complex matching</h3></div></div></div><p>Using Cypher, you can also express more complex patterns to match on, like a diamond shape pattern.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START a=node(3)
MATCH (a)-[:KNOWS]-&gt;(b)-[:KNOWS]-&gt;(c), (a)-[:BLOCKS]-(d)-[:KNOWS]-(c)
RETURN a,b,c,d</pre><p>
</p><p>This returns the four nodes in the paths.</p><div class="queryresult table"><a id="idp8360800"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /><col class="col3" /><col class="col4" /></colgroup><thead><tr><th align="left" valign="top">a</th><th align="left" valign="top">b</th><th align="left" valign="top">c</th><th align="left" valign="top">d</th></tr></thead><tfoot><tr><th colspan="4" align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[4]{name:"Bossman"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Emil"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[5]{name:"Cesar"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-shortest-path"></a>12.2.17. Shortest path</h3></div></div></div><p>Finding a single shortest path between two nodes is as easy as using the <code class="literal">shortestPath</code> function. It’s done like this:</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START d=node(1), e=node(2)
MATCH p = shortestPath( d-[*..15]-&gt;e )
RETURN p</pre><p>
</p><p>This means: find a single shortest path between two nodes, as long as the path is max 15 relationships long. Inside of the parenthesis
 you define a single link of a path — the starting node, the connecting relationship and the end node. Characteristics describing the relationship
 like relationship type, max hops and direction are all used when finding the shortest path. You can also mark the path as optional.</p><div class="queryresult table"><a id="idp8383744"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">p</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">[Node[1]{name:"David"},:KNOWS[2] {},Node[3]{name:"Anders"},:KNOWS[0] {},Node[4]{name:"Bossman"},:KNOWS[3] {},Node[2]{name:"Emil"}]</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-all-shortest-paths"></a>12.2.18. All shortest paths</h3></div></div></div><p>Finds all the shortest paths between two nodes.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START d=node(1), e=node(2)
MATCH p = allShortestPaths( d-[*..15]-&gt;e )
RETURN p</pre><p>
</p><p>This example will find the two directed paths between David and Emil.</p><div class="queryresult table"><a id="idp8397760"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">p</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">[Node[1]{name:"David"},:KNOWS[2] {},Node[3]{name:"Anders"},:KNOWS[0] {},Node[4]{name:"Bossman"},:KNOWS[3] {},Node[2]{name:"Emil"}]</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">[Node[1]{name:"David"},:KNOWS[2] {},Node[3]{name:"Anders"},:BLOCKS[1] {},Node[5]{name:"Cesar"},:KNOWS[4] {},Node[2]{name:"Emil"}]</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-named-path"></a>12.2.19. Named path</h3></div></div></div><p>If you want to return or filter on a path in your pattern graph, you can a introduce a named path.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START a=node(3)
MATCH p = a--&gt;b
RETURN p</pre><p>
</p><p>This returns the two paths starting from the first node.</p><div class="queryresult table"><a id="idp8413040"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">p</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">[Node[3]{name:"Anders"},:KNOWS[0] {},Node[4]{name:"Bossman"}]</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">[Node[3]{name:"Anders"},:BLOCKS[1] {},Node[5]{name:"Cesar"}]</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-matching-on-a-bound-relationship"></a>12.2.20. Matching on a bound relationship</h3></div></div></div><p>When your pattern contains a bound relationship, and that relationship pattern doesn’t specify direction,
Cypher will try to match the relationship where the connected nodes switch sides.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START r=rel(0)
MATCH a-[r]-b
RETURN a,b</pre><p>
</p><p>This returns the two connected nodes, once as the start node, and once as the end node.</p><div class="queryresult table"><a id="idp8428544"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /></colgroup><thead><tr><th align="left" valign="top">a</th><th align="left" valign="top">b</th></tr></thead><tfoot><tr><th colspan="2" align="left" valign="top">2 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[4]{name:"Bossman"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[4]{name:"Bossman"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Anders"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-match-with-or"></a>12.2.21. Match with OR</h3></div></div></div><p>Strictly speaking, you can’t do <code class="literal">OR</code> in your <code class="literal">MATCH</code>. It’s still possible to form a query that works a lot like <code class="literal">OR</code>.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START a=node(3), b=node(2)
MATCH a-[?:KNOWS]-x-[?:KNOWS]-b
RETURN x</pre><p>
</p><p>This query is saying: give me the nodes that are connected to <code class="literal">a</code>, or <code class="literal">b</code>, or both.</p><div class="queryresult table"><a id="idp8451024"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">x</th></tr></thead><tfoot><tr><th align="left" valign="top">3 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[4]{name:"Bossman"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[5]{name:"Cesar"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[1]{name:"David"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div></div><HR xmlns=""></HR><a xmlns="" href="ln-idp1112768.html"><p xmlns="http://www.w3.org/1999/xhtml" class="copyright">Copyright © 2014 Neo Technology</p></a><div class="navfooter"><hr /><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="query-start.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="query-read.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="query-where.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top"> </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> </td></tr></table></div></body></html>
